Repository: PDAC95/AC95-Project
Catalog: Resources/App.*.resx
Languages: es

# Android
source: Android App Development
es: Desarrollo de Aplicaciones Android

# AppService
source: App
es: Servicio

# AppTilte
source: App
es: Innovador

# Cross
source: Cross-Platform App Development
es: Desarrollo de Aplicaciones Multiplataforma

# Development
source: Development for
es: de Aplicaciones para

# DevelopmentApp
source: Development
es: de Desarrollo de

source: Innovative
es: Desarrollo

# iOS
source: iOS App Development
es: Desarrollo de Aplicaciones iOS

# Maintenance
source: App Maintenance and Support
es: Mantenimiento y Soporte de Aplicaciones

source: Our
es: Nuestro

source: Services
es: Aplicaciones

# Text1
source: At AC95, we offer comprehensive app development services that cater to businesses looking to innovate. From mobile apps to web applications, we build solutions that provide outstanding user experiences and drive business growth.
es: En AC95, ofrecemos servicios integrales de desarrollo de aplicaciones para empresas que buscan innovar. Desde aplicaciones móviles hasta aplicaciones web, creamos soluciones que brindan experiencias de usuario excepcionales e impulsan el crecimiento de tu negocio.

# Text2
source: We create high-performance, feature-packed iOS applications designed to engage users and deliver seamless experiences. From concept to launch, we ensure your iOS app stands out in the App Store.
es: Creamos aplicaciones iOS de alto rendimiento y con múltiples funciones, diseñadas para atraer a los usuarios y ofrecer experiencias fluidas. Desde la concepción hasta el lanzamiento, nos aseguramos de que tu aplicación iOS destaque en la App Store.

# Text3
source: Our team builds powerful Android apps that deliver excellent performance and user engagement. We develop apps tailored to the needs of your business, ensuring compatibility across a range of devices and OS versions.
es: Nuestro equipo desarrolla potentes aplicaciones Android que ofrecen un excelente rendimiento y una alta interacción con los usuarios. Creamos apps adaptadas a las necesidades de tu negocio, garantizando compatibilidad con una amplia variedad de dispositivos y versiones del sistema operativo.

# Text4
source: We specialize in cross-platform app development using frameworks like Xamarin and React Native. This allows us to create apps that work seamlessly on both iOS and Android, saving time and development costs while maintaining a high-quality user experience.
es: Nos especializamos en el desarrollo de aplicaciones multiplataforma utilizando frameworks como Xamarin y React Native. Esto nos permite crear apps que funcionen sin problemas tanto en iOS como en Android, reduciendo el tiempo y los costos de desarrollo sin comprometer la calidad de la experiencia del usuario.

# Text5
source: Our web application development services focus on building high-performing, scalable web apps that provide a seamless experience across browsers and devices. Whether it's a progressive web app (PWA) or a custom web solution, we deliver results that enhance user interaction and business efficiency.
es: Nuestros servicios de desarrollo de aplicaciones web se enfocan en crear aplicaciones de alto rendimiento y escalabilidad, ofreciendo una experiencia fluida en todos los navegadores y dispositivos. Ya sea una aplicación web progresiva (PWA) o una solución web personalizada, entregamos resultados que mejoran la interacción del usuario y la eficiencia empresarial.

# Text6
source: We provide ongoing maintenance and support services to keep your app running smoothly. From regular updates to bug fixes and feature enhancements, we ensure your app remains relevant and functional in a competitive market.
es: Ofrecemos servicios continuos de mantenimiento y soporte para garantizar el funcionamiento óptimo de tu aplicación. Desde actualizaciones periódicas hasta corrección de errores y mejoras de funciones, nos aseguramos de que tu app se mantenga relevante y funcional en un mercado competitivo.

# Web
source: Web Application Development
es: Desarrollo de Aplicaciones Web

source: Your Business
es: Tu Negocio
