Repository: PDAC95/AC95-Project
Catalog: Resources/Ecommerce.*.resx
Languages: es

# Custom
source: Custom E-Commerce Development
es: Desarrollo de Ecommerce Personalizado

source: Development
es: servicio

# Inventory
source: Inventory Management
es: Manejo de inventario

# Performance
source: Performance and SEO Optimization
es: Optimización de Rendimiento y SEO

# responsive
source: Responsive E-Commerce Design
es: Diseño Responsivo

# SecurePayment
source: Secure Payment Integration
es: Integración de Pagos Seguros

source: Services
es: de desarrollo

# Solutions
source: Solutions for
es: Soluciones para

# Start
source: Start Your Project
es: Empieza tu proyecto

# Text1
source: At AC95, we specialize in creating powerful, user-friendly e-commerce solutions that drive sales and enhance customer experiences. From product listings to secure payments, we ensure that your store is built for success.
es: En AC95, nos especializamos en crear soluciones de comercio electrónico potentes y fáciles de usar que impulsan las ventas y mejoran la experiencia del cliente. Desde la gestión de productos hasta pagos seguros, nos aseguramos de que tu tienda esté diseñada para el éxito.

# Text2
source: We develop fully customized e-commerce platforms tailored to your business needs. From product catalogs to shopping carts and payment gateways, our solutions are designed to provide a seamless shopping experience.
es: Desarrollamos plataformas de comercio electrónico totalmente personalizadas y adaptadas a las necesidades de tu negocio. Desde catálogos de productos hasta carritos de compra y pasarelas de pago, nuestras soluciones están diseñadas para ofrecer una experiencia de compra fluida.

# Text3
source: Our e-commerce stores are built with responsive design, ensuring they work seamlessly across all devices, from mobile to desktop. This guarantees a smooth shopping experience for your customers, no matter how they browse.
es: Nuestras tiendas de comercio electrónico están diseñadas con un enfoque responsivo, asegurando un funcionamiento fluido en todos los dispositivos, desde móviles hasta computadoras de escritorio. Esto garantiza una experiencia de compra óptima para tus clientes, sin importar cómo naveguen.

# Text4
source: We integrate secure payment gateways that allow customers to make payments easily and safely. Our e-commerce solutions support popular payment methods such as credit cards, PayPal, and more.
es: Integramos pasarelas de pago seguras que permiten a los clientes realizar pagos de manera fácil y protegida. Nuestras soluciones de comercio electrónico son compatibles con métodos de pago populares como tarjetas de crédito, PayPal y más.

# text5
source: Our systems include inventory management features that help you track stock levels, manage product listings, and update prices in real time, ensuring your online store is always accurate and up to date.
es: Nuestros sistemas incluyen funciones de gestión de inventario que te permiten monitorear niveles de stock, administrar listados de productos y actualizar precios en tiempo real, asegurando que tu tienda en línea esté siempre precisa y actualizada.

# Text6
source: We optimize your e-commerce site for fast loading times and high search engine rankings. Our SEO-focused development helps drive organic traffic and increases your chances of converting visitors into customers.
es: Optimizamos tu tienda en línea para tiempos de carga rápidos y un mejor posicionamiento en los motores de búsqueda. Nuestro desarrollo centrado en SEO ayuda a atraer tráfico orgánico y aumenta las posibilidades de convertir visitantes en clientes.

source: Your Business
es: tu negocio
