Repository: PDAC95/AC95-Project
Catalog: Resources/HowWeWork.*.resx
Languages: es

source: Affordable
es: Planes

# AffordableText
source: We offer flexible monthly plans that scale with your business, providing high-quality services at affordable rates, starting from *.
es: Ofrecemos planes mensuales flexibles que crecen con tu negocio, brindando servicios de alta calidad a precios accesibles desde *.

# Agile
source: Agile Developers
es: Desarrolladores Agile

# AppMa
source: App Maintenance and Support
es: Mantenimiento y Soporte de Aplicaciones

# AppMaText
source: Monthly maintenance and updates for your mobile app, ensuring optimal performance and security.
es: Mantenimiento y actualizaciones mensuales para tu aplicación móvil, garantizando un rendimiento óptimo y seguridad.

source: Approach
es: Enfoque

# AppText
source: High-performance mobile and web apps that are user-friendly, secure, and scalable.
es: Aplicaciones móviles y web de alto rendimiento, intuitivas, seguras y escalables.

# Backend
source: Backend Developers
es: Desarrolladores Backend

# BasicWeb
source: Basic Website Maintenance
es: Mantenimiento Básico de Sitios Web

# BasicWebText
source: Monthly updates, security checks, and minor adjustments to keep your website running smoothly.
es: Actualizaciones mensuales, verificaciones de seguridad y ajustes menores para mantener tu sitio web funcionando sin problemas.

# CustomSoftware
source: Custom Software Development
es: Desarrollo de Software Personalizado

# CustomSoftwareText
source: Full-scale custom software development to meet the specific needs of your business.
es: Desarrollo de software personalizado a gran escala para satisfacer las necesidades específicas de tu negocio.

# DevOps
source: DevOps Engineers
es: Ingenieros DevOps

source: Digital Marketing Package
es: Paquete de Marketing Digital

# DMText
source: Comprehensive SEO, social media management, and content marketing to boost your online presence.
es: SEO integral, gestión de redes sociales y marketing de contenidos para potenciar tu presencia en línea.

# EcomText
source: Robust and scalable e-commerce solutions to grow your business and enhance customer experience.
es: Soluciones de comercio electrónico robustas y escalables para hacer crecer tu negocio y mejorar la experiencia del cliente.

source: Explore Services
es: Explorar Servicios

# Frontend
source: Frontend Developers
es: Desarrolladores Frontend

# FullStack
source: Full Stack Developers
es: Desarrollador Full Stack

# Hire
source: Hire Dedicated Teams
es: Contrata Equipos Dedicados

# HireText
source: You can hire dedicated teams for software development, digital marketing, or design projects. We offer flexible hiring options, whether you need a team for a specific project, ongoing work, or sprint-based development cycles. Our teams are fully integrated into your business processes, ensuring seamless collaboration and high-quality results.
es: Puedes contratar equipos dedicados para desarrollo de software, marketing digital o proyectos de diseño. Ofrecemos opciones de contratación flexibles, ya sea para un proyecto específico, trabajo continuo o ciclos de desarrollo por sprints. Nuestros equipos se integran completamente en tus procesos empresariales, garantizando una colaboración fluida y resultados de alta calidad.

# HowWeTitle
source: How We Work with You
es: Como nosotros trabajamos para ti

# Month
source: Monthly Engagement
es: Servicio Mensual

# Monthly
source: Monthly Subscription Services
es: Servicios de Suscripción Mensual

# MonthlyText
source: Our monthly subscription services provide ongoing support for website maintenance, software updates, and digital marketing campaigns. This includes performance optimizations, feature enhancements, and continuous monitoring to keep your project running smoothly.
es: Nuestros servicios de suscripción mensual ofrecen soporte continuo para el mantenimiento de sitios web, actualizaciones de software y campañas de marketing digital. Esto incluye optimización del rendimiento, mejoras de funciones y monitoreo constante para garantizar que tu proyecto funcione sin problemas.

# MonthText
source: Hire a dedicated team for ongoing development, maintenance, or design services, with flexibility to adapt to your monthly needs.
es: Contrata un equipo dedicado para desarrollo, mantenimiento o servicios de diseño continuos, con la flexibilidad de adaptarse a tus necesidades mensuales.

source: Our
es: Nuestro

source: Our Solutions
es: Nuestras Soluciones

# Project
source: Project-Based Services
es: Servicios Basados en Proyectos

source: Project Managers
es: Gerentes de Proyecto

# ProjectServiceText
source: Get a dedicated team for a specific project, ensuring your project goals are met on time with high-quality deliverables.
es: Obtén un equipo dedicado para un proyecto específico, asegurando que tus objetivos se cumplan a tiempo con entregables de alta calidad.

# ProjectText
source: We offer project-based services across a wide range of areas, including software development, web design, and digital marketing. Whether you're looking to build a custom software solution, redesign your website, or create a digital marketing campaign, our team will deliver high-quality results tailored to your business needs.
es: Ofrecemos servicios basados en proyectos en diversas áreas, incluyendo desarrollo de software, diseño web y marketing digital. Ya sea que necesites una solución de software personalizada, rediseñar tu sitio web o crear una campaña de marketing digital, nuestro equipo te entregará resultados de alta calidad adaptados a las necesidades de tu negocio.

# ProjectTitle
source: Project-Based
es: Proyectos

# QA
source: QA Engineers
es: Ingenieros de QA

source: Services
es: Servicio

# SoftText
source: Custom software solutions tailored to your specific business challenges and goals.
es: Soluciones de software personalizadas, adaptadas a los desafíos y objetivos específicos de tu negocio.

# Sprint
source: Sprint-Based Engagement
es: Servicio por Sprint

# SprintText
source: Engage a team to work with you on a sprint basis, perfect for agile development environments where goals are achieved incrementally.
es: Incorpora un equipo para trabajar contigo por sprints, ideal para entornos de desarrollo ágil donde los objetivos se logran de manera incremental.

# Text1
source: At AC95, we offer flexible ways to work with us, tailored to your project needs. Whether you’re looking for one-time project services, ongoing support, or dedicated teams, we have the right solution to help you achieve your goals.
es: En AC95, ofrecemos formas de trabajo flexibles, adaptadas a las necesidades de tu proyecto. Ya sea que necesites servicios para un proyecto puntual, soporte continuo o equipos dedicados, tenemos la solución ideal para ayudarte a alcanzar tus objetivos.

# Title
source: How it works
es: Cómo Funciona

# UIUX
source: UI/UX Designers
es: Diseñadores UI/UX

# WebText
source: Custom websites designed to deliver top-tier performance and engaging user experiences.
es: Sitios web personalizados diseñados para ofrecer un rendimiento de alto nivel y experiencias de usuario atractivas.
