Repository: PDAC95/AC95-Project
Catalog: Resources/Marketing.*.resx
Languages: es

# BrandPositioning
source: Brand Positioning & Online Reputation
es: Posicionamiento de Marca y Reputación en Línea

source: Comprehensive
es: Soluciones Integrales de

source: Digital Marketing
es: Marketing Digital

source: Digital Marketing Services
es: Servicios de Marketing Digital

# DigitalMarketingTitle
source: Digital Marketing
es: Servicios de

source: Explore Services
es: Explorar Servicios

source: Our
es: Nuestros

# SEO
source: Search Engine Optimization (SEO) & Analytics
es: Optimización para Motores de Búsqueda (SEO) y Analítica

source: Services
es: Marketing Digital

source: Social Media Marketing
es: Marketing en Redes Sociales

source: Solutions for
es: para

# Text1
source: At AC95, we provide a full suite of digital marketing services to help your business thrive online. From SEO and brand positioning to social media campaigns and video marketing, our solutions are tailored to reach your audience and maximize your online presence.
es: En AC95, ofrecemos un conjunto completo de servicios de marketing digital para impulsar tu negocio en línea. Desde SEO y posicionamiento de marca hasta campañas en redes sociales y marketing en video, nuestras soluciones están diseñadas para llegar a tu audiencia y maximizar tu presencia digital.

# Text2
source: Boost your online visibility with our SEO strategies. We optimize your website for search engines to ensure higher rankings and increased traffic. We also provide comprehensive analytics to track the performance of your campaigns, allowing you to make data-driven decisions.
es: Aumenta tu visibilidad en línea con nuestras estrategias de SEO. Optimizamos tu sitio web para los motores de búsqueda, garantizando mejores rankings y mayor tráfico. Además, ofrecemos analíticas detalladas para medir el rendimiento de tus campañas y ayudarte a tomar decisiones basadas en datos.

# Text3
source: Engage your audience on platforms like Instagram, Facebook, LinkedIn, and more. Our social media marketing services include content creation, ad campaigns, and community management to build your brand and connect with your followers effectively.
es: Conéctate con tu audiencia en plataformas como Instagram, Facebook, LinkedIn y más. Nuestros servicios de marketing en redes sociales incluyen creación de contenido, campañas publicitarias y gestión de comunidades para fortalecer tu marca y generar una conexión efectiva con tus seguidores.

# Text4
source: Video is one of the most powerful tools in digital marketing. We create engaging video content for YouTube, social media, and websites, helping you tell your story and showcase your brand. From promotional videos to tutorials and product demos, we’ve got you covered.
es: El video es una de las herramientas más poderosas en el marketing digital. Creamos contenido audiovisual atractivo para YouTube, redes sociales y sitios web, ayudándote a contar tu historia y destacar tu marca. Desde videos promocionales hasta tutoriales y demostraciones de productos, tenemos todo cubierto.

# Text5
source: We help you position your brand effectively in the digital landscape. Through consistent messaging, creative branding, and reputation management, we ensure that your brand stands out and maintains a positive image online. We monitor reviews, ratings, and mentions to keep your brand’s reputation intact.
es: Te ayudamos a posicionar tu marca de manera efectiva en el entorno digital. A través de mensajes consistentes, branding creativo y gestión de reputación, nos aseguramos de que tu marca se destaque y mantenga una imagen positiva en línea. Monitoreamos reseñas, calificaciones y menciones para proteger la reputación de tu negocio.

# VideoMarketing
source: Video Marketing & Content Creation
es: Marketing en Video y Creación de Contenido

source: Your Business
es: Tu Negocio
