Repository: PDAC95/AC95-Project
Catalog: Resources/MonthEcom.*.resx
Languages: es

source: Customer Support Integration
es: Integración de Soporte al Cliente

# E-commerceSub
source: E-commerce
es: Mensuales de

# E-commerceTitle
source: E-commerce
es: Gestión Mensual

source: E-commerce Management
es: Mantenimiento E-Commerce

# MaintenanceTitle
source: Maintenance &
es: de

# ManagementTitle
source: Management
es: E-commerce

# MonthlyStore
source: Monthly Store Maintenance
es: Mantenimiento Mensual de Tienda

# MonthlySub
source: Monthly
es: Servicios

# MonthlyTitle
source: Monthly
es: Mantenimiento y

source: Our
es: Nuestros

# PerformanceOptimization
source: E-commerce Performance Optimization
es: Optimización del Rendimiento de E-commerce

# Product
source: Product & Inventory Management
es: Gestión de Productos e Inventario

# SecurityPayment
source: Security & Payment Gateway Updates
es: Actualizaciones de Seguridad y Pasarelas de Pago

# ServicesSub
source: Services
es: E-commerce

# Text1
source: Keep your online store running smoothly with our comprehensive monthly e-commerce maintenance and management services. From product updates to performance optimization, we ensure your store remains competitive and efficient.
es: Mantén tu tienda en línea funcionando sin problemas con nuestros completos servicios mensuales de mantenimiento y gestión de e-commerce. Desde actualizaciones de productos hasta optimización del rendimiento, nos aseguramos de que tu tienda siga siendo competitiva y eficiente.

# Text2
source: We provide monthly maintenance for your e-commerce store, ensuring it runs smoothly with regular updates, security patches, and performance checks. We handle all the technical aspects so you can focus on growing your business.
es: Ofrecemos mantenimiento mensual para tu tienda de e-commerce, garantizando su funcionamiento óptimo con actualizaciones regulares, parches de seguridad y revisiones de rendimiento. Nos encargamos de los aspectos técnicos para que puedas enfocarte en hacer crecer tu negocio.

# Text3
source: We manage your product listings and inventory, ensuring all items are up-to-date, accurately described, and available for purchase. From adding new products to updating stock, we handle it all seamlessly.
es: Gestionamos tus listados de productos e inventario, asegurando que todos los artículos estén actualizados, correctamente descritos y disponibles para la venta. Desde la incorporación de nuevos productos hasta la actualización de stock, nos encargamos de todo de manera eficiente.

# Text4
source: We optimize your online store's performance for speed, user experience, and conversion rates. From faster load times to improved checkout processes, we help you boost sales and customer satisfaction.
es: Optimizamos el rendimiento de tu tienda en línea para mejorar la velocidad, la experiencia del usuario y las tasas de conversión. Desde tiempos de carga más rápidos hasta procesos de pago optimizados, te ayudamos a aumentar las ventas y la satisfacción del cliente.

# Text5
source: Ensure your e-commerce platform is always secure and up-to-date with the latest payment gateway and security updates. We monitor your website's security and ensure safe transactions for your customers.
es: Asegura que tu plataforma de e-commerce esté siempre protegida y actualizada con las últimas mejoras en seguridad y pasarelas de pago. Monitoreamos la seguridad de tu sitio y garantizamos transacciones seguras para tus clientes.

# Text6
source: We integrate and manage customer support solutions, ensuring your customers can easily contact you for inquiries, returns, or issues. Our team ensures that your customer support system remains efficient and responsive.
es: Integramos y gestionamos soluciones de soporte al cliente, asegurando que tus clientes puedan contactarte fácilmente para consultas, devoluciones o problemas. Nuestro equipo garantiza que tu sistema de atención al cliente sea eficiente y receptivo.
