Repository: PDAC95/AC95-Project
Catalog: Resources/monthlydesign.*.resx
Languages: es

source: Brand Identity Design
es: Gráficos para Redes Sociales

source: Custom Graphic Design
es: Diseño Gráfico Personalizado

source: Design
es: Gráfico

source: Graphic
es: Diseño

source: Graphic Design
es: Diseño Gráfico

# GraphicDesignS
source: Graphic Design
es: Mensuales de

source: Marketing Materials
es: Materiales de Marketing

source: Monthly
es: Servicios

# MonthlyTitle
source: Monthly
es: Servicios Mensuales de

source: Our
es: Nuestros

# Print
source: Print & Digital Assets
es: Material Impreso y Digital

# Service
source: Services
es: Diseño Gráfico

source: Services
es: Personalizado

source: Social Media Graphics
es: Gráficos para Redes Sociales

source: Subscribe Now
es: Suscríbete Ahora

# Text1
source: Our graphic design subscription service provides you with ongoing design support every month. Whether you need logos, marketing materials, or social media graphics, our team delivers high-quality designs tailored to your brand.
es: Nuestro servicio de suscripción de diseño gráfico te ofrece soporte continuo cada mes. Ya sea que necesites logotipos, materiales de marketing o gráficos para redes sociales, nuestro equipo crea diseños de alta calidad adaptados a tu marca.

# Text2
source: Get custom graphic design solutions tailored to your brand's needs. From logos to business cards and product packaging, we create designs that enhance your visual identity and make a lasting impact.
es: Obtén soluciones de diseño gráfico personalizadas según las necesidades de tu marca. Desde logotipos hasta tarjetas de presentación y empaques de productos, creamos diseños que refuerzan tu identidad visual y dejan una impresión duradera.

# Text3
source: We design eye-catching marketing materials like brochures, flyers, and banners to help you promote your business. Our designs are created to grab attention and drive engagement with your audience.
es: Diseñamos materiales de marketing atractivos, como folletos, volantes y banners, para ayudarte a promocionar tu negocio. Nuestros diseños están creados para captar la atención y generar interacción con tu audiencia.

# Text4
source: Our team creates engaging social media graphics to boost your online presence. From Instagram posts to Facebook banners, we design content that aligns with your brand and engages your followers.
es: Nuestro equipo crea gráficos atractivos para redes sociales que potencian tu presencia en línea. Desde publicaciones de Instagram hasta banners de Facebook, diseñamos contenido alineado con tu marca para captar la atención de tus seguidores.

# Text5
source: We help businesses develop a strong visual identity by designing logos, color schemes, and typography that reflect your brand's personality and values. Our brand identity designs set you apart from the competition.
es: Ayudamos a las empresas a desarrollar una identidad visual sólida mediante el diseño de logotipos, paletas de colores y tipografías que reflejan la personalidad y los valores de tu marca. Nuestras soluciones de identidad de marca te diferencian de la competencia.

# Text6
source: From digital banners to printed materials, we provide designs that work across all formats. Whether for online ads, print campaigns, or trade show materials, we create assets that are visually stunning and effective.
es: Desde banners digitales hasta materiales impresos, ofrecemos diseños que se adaptan a todos los formatos. Ya sea para anuncios en línea, campañas impresas o materiales para ferias, creamos piezas visualmente impactantes y efectivas.
